Tekla Open API Reference for Tekla Structures 2025
ModelObjectEnumerator.GetEnumerator Method
 Gets the enumerator.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
Return Value
Type: IEnumerator
The enumerator.
See Also
Reference
ModelObjectEnumerator Class
Tekla.Structures.Model Namespace